Revit 2027 API
FamilyThermalProperties.ThermalResistance Property
 The calculated thermal resistance value (R-Value). The units are meter-squared kelvin per watt ((m^2*K)/Watt).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ThermalResistance { get; }
Public ReadOnly Property ThermalResistance As Double
	Get
public:
property double ThermalResistance {
	double get ();
}
member ThermalResistance : float with get
Property Value
Double
See Also
Reference
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace